/* External Format Names. */

/* The key is the numeric value as defined in SecImportExport.h in Apple's Security framework.  Last updated for 10.4.10. */
/* The value is a human-readable name for the given code. */

0 = "Unknown";

1 = "OpenSSL";
2 = "SSH";
3 = "BSAFE";

4 = "Raw Key";

5 = "Wrapped PKCS8";
6 = "Wrapped OpenSSL";
7 = "Wrapped SSH";
8 = "Wrapped LSH";
	
9 = "X.509 Certificate";

10 = "PEM Sequence";
11 = "PKCS7";
12 = "PKCS12";
13 = "Netscape Certificate Sequence";
